{
    "President": "The President is responsible for managing the day-to-day affairs of the MGSA and acting as chair at any general meeting. The President is also responsible for making financial decisions in conjunction with the Treasurer. It is the President's duty to act in accordance with any decision arrived at by a majority vote at a general meeting or a meeting of the executive.",
    "Vice president": "The Vice President serves as a substitute for the President in the event of their unavailability and assists in planning and implementing MGSA events. The Vice President acts as an Executive-at-large and is involved in various MGSA events throughout the year.",
    "Treasurer": "The Treasurer is responsible for maintaining records of the MGSA's financial transactions and writing checks to reimburse expenses. It is the Treasurer's duty to accurately and transparently manage the MGSA's financial resources, ensuring that they are used in a responsible and effective manner.",
    "Secretary": "The Secretary is responsible for taking minutes at all MGSA meetings and performing other secretarial duties. If there is no designated Webmaster, the Secretary is also responsible for maintaining the MGSA's website.",
    "Webmaster": "The Webmaster is responsible for maintaining the MGSA's website. They also provide assistance to other cabinet members with computer-related tasks when needed and possible.",
    "CUPE representatives": "The CUPE representatives serve as representatives of the MGSA at various union meetings and events. They are responsible for reporting important union business to MGSA members and bringing any concerns of the members to the attention of the union.",
    "Graduate seminar committee": "The Graduate Seminar Committee is responsible for organizing the weekly graduate student seminar. This includes finding speakers and arranging for the provision of refreshments, financed by the MGSA. Committee members should strive to ensure that the seminar is well-attended and informative for all attendees.",
    "Departmental council representatives": "The Departmental Council meets twice a year to discuss issues related to the general management of the department and its various programs. Members of the Departmental Council should be prepared to actively participate in these meetings and contribute their insights and ideas.",
    "Graduate planning committee representatives": "The Graduate Planning Committee is responsible for deciding the course of the graduate program in the department. This includes discussing course offerings for the coming year and encouraging graduate students to participate in the decision-making process. Members of the Graduate Planning Committee should be proactive and forward-thinking in their approach to shaping the future of the graduate program.",
    "Social committee": "The Social Committee is responsible for organizing recreational and educational events throughout the year. This includes planning weekly tea times, pub nights, dinners, movie nights, ice skating, potlucks, math events, and summer softball. Each member of the Social Committee is expected to organize or co-organize 3 to 4 events during their one-year term. Specific sub-positions within the Social Committee include Athletic Captain, Tea Master, Top Gamer, and Creative Members.",
    "MU liaison": "The MU Liaison serves as a messenger between the Undergraduate Math Union (MU) and the MGSA. Their duties include forwarding email announcements of MGSA events to the MU contact person and forwarding messages from the MU contact person to the appropriate members of the MGSA cabinet. This position becomes void during years when the MU is inactive.",
    "Computer committee representative": "The Computer Committee is responsible for deciding on computer hardware and software purchases by the department and addressing other administrative computer-related issues. The graduate student representative on the Computer Committee should act as a liaison between the graduate students and the computer support staff, directing computer-related requests to the appropriate parties.",
    "Library committee representatives": "The Library Committee is responsible for deciding on books to be purchased for the mathematics library collection. Members of the Library Committee should be knowledgeable about the needs and interests of the department and strive to build a comprehensive and relevant library collection."
}

